# 1.프로그래밍 기초

#  - 프로그래밍이란?
#     프로그래밍 : c, c++, java, python, vb, pascal, ruby... 
#     -> 특징 영문(인간) -> 컴파일러 -> 기계어 -> cpu -> 실행 -> 결과물
 
#  - 코딩 공부 방법
#     1. 디버깅 -> 내 의도에 맞게 프로그램이 실행 되는지 여부 확인! 한 수 앞을 보면서 생각하기 에러 유무 사전 차단
#     2. 알고리즘, 자료구조 -> 코딩테스트 필수!
#     3. 다른 사람의 소스코드 참조 -> Git 허브 -> 오픈소스를 보면서 개인적인 의견 내보면서 참조
#     4. 주석을 달면서 코딩 -> 코드의 이해 증가
#     5. 자기가 만들고 싶은 프로그램을 정확하게 정의하는게 중요하다.
#         A : 원하는 사이트를 정확히 방문 -> B: 원하는 항목을 정확히 가져오기 -> C: 원하는 항목 속의 데이터를 정확히 가져오기
    
#  - 좋은 프로그램이란? - 좋은 습관을 들여놓으면 좋은 프로그램을 만드는데 도움이 된다.
#     1. 코드의 가독성 -> 수정과 개선이 이루어지는 과정에서 가독성이 낮다면 시간과 비용이 추가적으로 들어갈 수 있다.
#     2. 코드의 길이 : 불필요한 변수나 선언해놓고 쓰이지 않는 것들은 삭제하는게 좋다. 가독성과 연관
#     3. 변수의 이름 : 변수의 이름만 봐도 어떤의도로 선언된 변수인지를 알수있는게 좋다.
#     4. 중복 코드 줄이자. -> 공간복잡도와 시간복잡도를 줄여주며 비용을 감소시키고 최적화된 프로그램을 만들 수 있다.


# 2. 파이썬 배우는 이유
 
#  - 파이썬 장점 -> 파이썬 유징 사이트 : 구글, 인스타그램, 유튜브 등
#     1. 간결하고 쉽다.
#     2. 무료이며, 오픈소스의 강력함이 있다. 짧은 시간동안 고도화된 복잡한 어플을 만들어낼 수 있다.
#     3. 협업이 수월하다. 빠른 개발속도
#     4. 다양한 분야에서 활용가능하다.

#  - 파이썬 활용 분야
#     1. GUI 프로그래밍 : pyQT
#     2. 웹프로그래밍 : flask, django..
#     3. 데이터분석, 머신러닝
#     4. IOT : 라즈베리파이를 이용한 기계학습
 
#  - 파이썬 언어 특징
